IDEA Open Model
Element2D.ElementType Property
Compatible with IDEA StatiCa v 10.1
 Analysis type - shell, plate, wall
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public Element2DType ElementType { get; set; }
Public Property ElementType As Element2DType
	Get
	Set
public:
property Element2DType ElementType {
	Element2DType get ();
	void set (Element2DType value);
}
Property Value
Type: Element2DType
See Also
Reference
Element2D Class
IdeaRS.OpenModel.Model Namespace